# GetCustomObjectPath

## Description
Returns a handle to the path polygon of a path custom object.

```pascal
FUNCTION GetCustomObjectPath(objectHand : HANDLE): HANDLE;
```

```python
def vs.GetCustomObjectPath(objectHand):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHand|HANDLE|Handle to object.|

## See Also
VS Functions:
SetCustomObjectPath

## Version
Availability: from VectorWorks8.5

## Category
* Objects - Custom